module.exports = {
  async up(queryInterface, Sequelize) {
    await queryInterface.bulkInsert('Authors', [{
      name: 'Джек Лондон',
      description: 'Настоящее имя Джон Гриффит Чейни (John Griffith Chaney). Родился 12 января 1876 года в Сан-Франциско. Несколько известных произведений Лондона посвящено проблемам эволюции. За рубежом неоднократно выходили сборники фантастических произведений Джека Лондона состав которых заметно варьировал, в зависимости от задачи составителя. На русском языке подобный сборник выходил в 1993 году, когда составитель Виль Быков попытался собрать под одной обложкой всю переведенную фантастическую малую прозу Джека Лондона.',
      photo: 'https://upload.wikimedia.org/wikipedia/commons/f/f9/Jack_London_Genthe.jpg',
      rating: 9,
    },
    {
      name: 'Агата Кристи',
      description: 'Псевдоним автора: Мэри Уэстмакотт; Мэри Вестмакотт; Mary Westmacott. Агата Кристи (полное имя: Агата Мэри Кларисса Маллоуэн, урожденная Миллер) — английская писательница.',
      photo: 'https://knigogid.ru/storage/authors/9/1/f/f/9/2/8af3a42c26cce8a207f227557a843b35.jpg',
      rating: 8.1,
    },
    {
      name: 'Марио Пьюзо',
      description: '...мне стыдно говорить об этом, но «Крёстного отца» я написал исключительно из того, что мог найти в другой литературе. Я никогда не встречал настоящего честного гангстера Марио Пьюзо — американский писатель итальянского происхождения, критик, сценарист и беллетрист.Родился 15 октября 1920 года в Нью-Йорке в семье итальянских иммигрантов. Во время Второй мировой войны служил в частях ВВС США в Восточной Азии и в Германии..',
      photo: 'https://knigogid.ru/storage/authors/236/f61/6ec/d9ba0dcb63cefcd6bbed00b32486eab6.jpg',
      rating: 8.1,
    },
    {
      name: 'Артур Конан Дойл',
      description: 'Английский писатель ирландского происхождения, автор многочисленных приключенческих, исторических, публицистических, фантастических и юмористических произведений. Создатель классических персонажей детективной, научно-фантастической и историко-приключенческой литературы: гениального сыщика Шерлока Холмса, эксцентричного профессора Челленджера, бравого кавалерийского офицера Жерара, благородного рыцаря сэра Найджела. ',
      photo: 'https://knigogid.ru/storage/authors/91f/f92/948/cc0/81b/c66135374fd939d4f27c8c9c2b9f62d6.jpg',
      rating: 7.9,
    },
    {
      name: 'Михаил Булгаков',
      description: 'Псевдоним автора: М. Ол-Райт; М. Мишев; Ф. Икс; Тускарора. Булгаков, Михаил Афанасьевич (1891–1940), русский писатель. Родился 3 (15) мая 1891 в Киеве в семье профессора Киевской духовной академии. Семейные традиции переданы Булгаковым в романе «Белая гвардия» (1924) укладу дома Турбиных. В 1909, по окончании лучшей в Киеве Первой гимназии, Булгаков поступил на медицинский факультет Киевского университета.',
      photo: 'https://knigogid.ru/storage/authors/86/05/59/45/ae/a29a7f72b2b2d87318350dda3cea8877.png',
      rating: 7.7,
    },
    {
      name: 'Николай Гоголь',
      description: 'Псевдоним автора: Рудый Панько; Г. Янов; ОООО; П. Глечик; В. Алов; N. N.; Николай Васильевич Яновский. Николай Васильевич Гоголь (фамилия при рождении Яновский, с 1821 года Гоголь-Яновский) родился 20 марта (1 апреля) 1809 года в местечке Большие Сорочинцы на границе Полтавского и Миргородского уездов (Полтавская губерния). Он происходил из старинного украинского казацкого рода. В смутные времена Украины некоторые из его предков приставали и к шляхетству',
      photo: 'https://knigogid.ru/storage/authors/fa7/90d/8bd/662/62b/2a37540a37ff532eb3bf37320ccc8ab9.jpg',
      rating: 8.0,
    },
    {
      name: 'Стефани Майер',
      description: 'Псевдоним автора: Рудый Панько; Г. Янов; ОООО; П. Глечик; В. Алов; N. N.; Николай Васильевич Яновский. Николай Васильевич Гоголь (фамилия при рождении Яновский, с 1821 года Гоголь-Яновский) родился 20 марта (1 апреля) 1809 года в местечке Большие Сорочинцы на границе Полтавского и Миргородского уездов (Полтавская губерния). Он происходил из старинного украинского казацкого рода. В смутные времена Украины некоторые из его предков приставали и к шляхетству',
      photo: 'https://knigogid.ru/storage/authors/4/5/b/6/2/ac75e3a741d0a4642471072197eac7ec.jpg',
      rating: 7.4,
    },
    {
      name: 'Чак Паланик',
      description: 'ЧАК ПАЛАНИК (CHARLES MICHAEL «CHUCK» PALAHNIUK) — современный американский писатель и независимый журналист. Наиболее известен как автор книги «Бойцовский клуб», по который позже был снят фильм Дэвидом Финчером. Его творения, подобные по стилю произведениям таких писателей, как Брет Истон Эллис, Ирвин Уэлш и Дуглас Коупленд, сделали его одним из наиболее популярных романистов "Поколения Икс". ',
      photo: 'https://knigogid.ru/storage/authors/9/1/5dc46dc5d809c204eb00e57a84909558.jpg',
      rating: 7.4,
    },
    {
      name: 'Стивен Кинг',
      description: 'Псевдоним автора: Ричард Бахман; Джон Свитзен; Берил Эванс. Стивен Эдвин Кинг (англ. Stephen Edwin King) — американский писатель, работающий в разнообразных жанрах, включая ужасы, триллер, фантастику, фэнтези, мистику, драму. Не только по созвучию с фамилией, но в первую очередь благодаря своим выдающимся литературным достижениям в жанре получил прозвище «Король ужасов».',
      photo: 'https://knigogid.ru/storage/authors/d/9/4/d/1/2/42c865613cf8d7535af7f10b33a7061a.jpg',
      rating: 7.8,
    },
    {
      name: 'Артур Шопенгауэр',
      description: 'АРТУР ШОПЕНГАУЭР — немецкий философ, один из самых известных мыслителей иррационализма, «философ пессимизма». Артур Шопенгауэр происходил из состоятельной купеческой семьи. Отец философа, Генрих Флорис Шопенгауэр, хотя и бывал неуравновешен (вспыльчив и склонен к депрессии), имел репутацию доброго, открытого, независимого в своих суждениях человека и честного коммерсанта. ',
      photo: 'https://knigogid.ru/storage/authors/62/d9499b30b8eaf8a5d76baf462c004558.jpg',
      rating: 8.1,
    },
    {
      name: 'Лев Толстой',
      description: 'Псевдоним автора: Л.Н.; Л.Н.Т.. Граф Лев Николаевич Толстой (28 августа [9 сентября] 1828, Ясная Поляна, Тульская губерния, Российская империя — 7 [20] ноября 1910, станция Астапово, Рязанская губерния, Российская империя) — один из наиболее известных русских писателей и мыслителей, один из величайших писателей-романистов мира. Участник обороны Севастополя.',
      photo: 'https://knigogid.ru/storage/authors/b/a/b/063620d6af8cf4735eeb8a79cb32c1c0.jpg',
      rating: 7.9,
    },
    {
      name: 'Владимир Владимирович Козлов',
      description: 'Владимир Владимирович Козлов — российский и белорусский писатель, переводчик, журналист, сценарист и режиссёр. Родился в Могилёве (Беларусь). Закончил среднюю школу, поступил в Могилёвский машиностроительный институт, откуда ушёл после третьего курса. Несколько лет жил в Минске, закончил Минский Лингвистический Университет по специальности «Английский язык», затем школу журналистики при Университете штата Индиана в Блумингтоне, (США). Работал переводчиком, журналистом, редактором.',
      photo: 'https://knigogid.ru/storage/authors/9a6/5fc/883/063/264/f3f39230b0879bc2b18311cc922bcc84.jpg',
      rating: 7.1,
    },
    {
      name: 'Гомер',
      description: 'Гомер — легендарный древнегреческий поэт-сказитель, которому приписывается создание «Илиады» и «Одиссеи».О жизни и личности Гомера достоверно ничего не известно. Ясно, однако, что «Илиада» и «Одиссея» были созданы значительно позже описываемых в них событий, но раньше VI века до н. э., когда достоверно зафиксировано их существование.',
      photo: 'https://knigogid.ru/storage/authors/b4/1a/bf/2d/a8/0bcfa29ebcb0af21b074d0b21f305b00.jpg',
      rating: 7.9,
    },
    {
      name: 'Александр Пушкин',
      description: 'Псевдоним автора: Иван Петрович Белкин; Феофилакт Косичкин; Тит Космократов; Александр Н.к.ш.п.. Пушкин Александр Сергеевич - русский поэт, драматург и прозаик, заложивший основы русского реалистического направления, критик и теоретик литературы, историк, публицист; один из самых авторитетных литературных деятелей первой трети XIX века.',
      photo: 'https://knigogid.ru/storage/authors/d9/4d/3c7f692e54fa020c6c7e4a5442bf7d6f.jpg',
      rating: 7.8,
    },
    {
      name: 'Михаил Лермонтов',
      description: 'Михаил Юрьевич Лермонтов — русский поэт, оставивший наследие, давшее образцы гражданской, философской и любовной лирики. Также является автором нескольких романов и пьес, часть которых остались неоконченными.Родился в Москве 3(15) октября 1814 г.Отец поэта, Юрий Петрович, происходил от древнего шотландского рода Лермонт, восходящего к XI веку. ',
      photo: 'https://knigogid.ru/storage/authors/91f/f92/948/cc0/81b/b5b/d3db6d667cade42de4225f9f7acd7294.jpg',
      rating: 8.0,
    },
    {
      name: 'Уильям Шекспир',
      description: 'Кингсли Эмис (Kingsley Amis, 16.04.1922, Лондон - 22.10.1995)Романист, поэт. Награждён орденом Британской империи (1981). В годы Второй мировой войны был в армии (1942-1945). После окончания Оксфордского университета преподавал английскую литературу в университете Суонси (1948-1961), затем в Кембриджском (1961-1963) и Принстонском университетах.Творческий путь Эмис начинал как поэт. ',
      photo: 'https://knigogid.ru/storage/authors/ae/3c/b8/8a/cd/2b7acfd937772d460536045045fa1600.jpg',
      rating: 8.2,
    },
    {
      name: 'Марк Мэнсон',
      description: 'Кингсли Эмис (Kingsley Amis, 16.04.1922, Лондон - 22.10.1995)Романист, поэт. Награждён орденом Британской империи (1981). В годы Второй мировой войны был в армии (1942-1945). После окончания Оксфордского университета преподавал английскую литературу в университете Суонси (1948-1961), затем в Кембриджском (1961-1963) и Принстонском университетах.Творческий путь Эмис начинал как поэт. ',
      photo: 'https://knigogid.ru/storage/authors/b/4/0/d/5/9/9/862232b9503ebc3beda7edf8325bfd0c.jpg',
      rating: 7.1,
    },
    {
      name: 'Дэниел Киз',
      description: 'Американский писатель и ученый-филолог, автор десяти романов и нескольких десятков рассказов (из них только 10 относятся к фантастике). Ранние рассказы писатель издавал под псевдонимами «Крис Дэниел» (Kris Daniel), «Э. Д. Лок» (A. D. Locke) и «Доминик Георг» (Dominik Georg).Родился в Нью-Йорке в знаменитом районе Бруклин.  ',
      photo: 'https://knigogid.ru/storage/authors/d94/d12/d2e/df8/7ae/afd/a5b/4ccde5b2b8415c8c98c8299c8eb3f7c0.jpg',
      rating: 8.0,
    },
    {
      name: 'Дмитрий Глуховский',
      description: 'Дмитрий Алексеевич Глуховский — современный российский писатель-фантаст, военный корреспондент и радиоведущий.Родился и вырос в Москве, где окончил арбатскую школу №1231 им. В.Д. Поленова с углублённым изучением французского языка. Высшее образование по специальностям журналистика и международные отношения получил в Иерусалимском университете.Четыре с половиной года жил и учился в Израиле, работал в Германии и во Франции. Был военным корреспондентом в Израиле и Абхазии, работал на «Радио России»... ',
      photo: 'https://knigogid.ru/storage/authors/2/3/6/f/e87ba08bed1cbd4ecb0d4efefa4e5dfc.jpg',
      rating: 7.4,
    },
    {
      name: 'Энди Вейер',
      description: 'Энди Вейер — американский писатель, получивший известность благодаря своему роману «Марсианин». В русскоязычных изданиях встречаются также версии транслитерации Вейр, Вейер.Родился в городе Дейвис и вырос в городе Ливермор. В средней школе он начал изучать компьютер. В возрасте 15-ти лет поступил на работу программистом в Сандийские национальные лаборатории в Ливерморе.',
      photo: 'https://knigogid.ru/storage/authors/495/95e/dd3/c4b/acb/79e/5d33a1b087a3d26254c73d2d4ca55c6f.jpg',
      rating: 7.4,
    },
    {
      name: 'Сьюзен Коллинз',
      description: 'Писательница Сьюзен Коллинз изучала драматургию в университете Нью-Йорка, где получила степень магистра изящных искусств. С 1991 года Сьюзен работала на телевидении, была автором детских телепередач и мультсериалов, а также участвовала в создании нескольких проектов, шедших на канале «Nickelodeon»',
      photo: 'https://knigogid.ru/storage/authors/a/e/3/c/b/19612d29a9da6bf68827c2e7d0651db4.jpg',
      rating: 8.5,
    },
    {
      name: 'Джеймс Дэшнер',
      description: 'Джеймс Дэшнер родился и вырос в Джорджии. Он закончил Университет Бригама Янга (Brigham Young University), где изучал бухгалтерское дело. Прежде чем посвятить себя карьере писателя работал в сфере финансов. По его словам, абсолютно не скучает по цифрам. Является автором известных книг для детей и взрослых "The 13th Reality series", "The Jimmy Fincher Saga" и "The Maze Runner series". Джеймс живет в Скалистых горах в штате Юта вместе со своей семьей.',
      photo: 'https://knigogid.ru/storage/authors/b/4/0/d/5/9/9/252449fadf37b6c72f12fa244515756c.jpg',
      rating: 8.0,
    },
    {
      name: 'Александр Князев',
      description: 'Уважаемый человек',
      photo: 'https://elbrusboot.camp/static/f9669df1d4da18615148b49b7dc0131b/528bd/knyazev.webp',
      rating: 10.0,
    },
    {
      name: 'Юлия Павлова',
      description: 'Уважаемый человек',
      photo: 'Photo soon',
      rating: 10.0,
    },
    {
      name: 'Адам Балкоев',
      description: 'Уважаемый человек',
      photo: 'https://elbrusboot.camp/static/eb60e8f93c4fdc2786ad8dff12b4d6e4/528bd/balkoev.webp',
      rating: 10.0,
    },
    {
      name: 'Антон Панферов',
      description: 'Уважаемый человек',
      photo: 'https://elbrusboot.camp/static/eeb0b32eb813dfd2d16b78d4d9275048/528bd/panferov.webp',
      rating: 10.0,
    },
    {
      name: 'Osamu Tezuka',
      description: 'Осаму Тэдзука — японский мангака, аниматор, доктор философии по специальности «медицина». Осаму Тэдзука внёс значительный вклад в дело становления манги и аниме. За свою карьеру он создал около 500 манг, за что был удостоен многих премий и наград',
      photo: 'https://fr.web.img6.acsta.net/c_310_420/medias/nmedia/18/78/35/44/19457846.jpg',
      rating: 10.0,
    },
    {
      name: 'Коёхару Готоугэ',
      description: 'Коёхару Готоугэ — японский художник-манга, известный благодаря манге «Убийца демонов: Кимэцу но Яиба». По состоянию на февраль 2021 года тираж манги составил более 150 миллионов экземпляров, что сделало ее девятой самой продаваемой серией манги за все время.',
      photo: 'http://sun9-64.userapi.com/impg/YEu87N5YiA8Lk2X8EPIu-EdUyimKQZ_zXFyJwQ/wtLzhebIxFI.jpg?size=768x692&quality=96&sign=609445913a2805f192bc06b0fe7a9b7f&type=album',
      rating: 10.0,
    },

    ]);
  },

  async down(queryInterface, Sequelize) {
    await queryInterface.bulkDelete('Authors', null, {});
  },
};
